In [2]:
import numpy as np
import pandas as pd

from IPython.display import display, HTML

# Series

In [3]:
# Trivial Series data object with default indices
a = pd.Series([34,23,56,76,212,56,776])
print("a={}".format(a))
print("Index={}, Values={}\n".format(a.index, a.values))

# Accessing individual elements of a series with default indices
print("a[3]={}".format(a[3]))
print("Slicing is also same as in numpy a[2:6]={}".format(a[2:6]))

a=0     34
1     23
2     56
3     76
4    212
5     56
6    776
dtype: int64
Index=RangeIndex(start=0, stop=7, step=1), Values=[ 34  23  56  76 212  56 776]

a[3]=76
Slicing is also same as in numpy a[2:6]=2     56
3     76
4    212
5     56
dtype: int64

In [4]:
# Series object with custom indices
a = pd.Series([34,23,56,76,212,56,776], index=["A","B","C","D","E","F","NA"])

print("a={}".format(a))
print("Index={}, Values={}\n".format(a.index, a.values))

# Accessing individual elements of a series with default indices
print("a[3]={}".format(a[3]))
print("a[NA]={}".format(a["NA"]))
print("Slicing is also same as in numpy a[2:6]={}".format(a[2:6]))
print("Slicing is also same as in numpy a[B:E]={}".format(a["B":"E"]))

a=A      34
B      23
C      56
D      76
E     212
F      56
NA    776
dtype: int64
Index=Index(['A', 'B', 'C', 'D', 'E', 'F', 'NA'], dtype='object'), Values=[ 34  23  56  76 212  56 776]

a[3]=76
a[NA]=776
Slicing is also same as in numpy a[2:6]=C     56
D     76
E    212
F     56
dtype: int64
Slicing is also same as in numpy a[B:E]=B     23
C     56
D     76
E    212
dtype: int64

# DataFrame

In [5]:
corigin = pd.Series(["egypt","india","pakistan", "china","india", "tibet","us"], index=["nile","ganga","indus","brahmaputra","yangtze","mekong","mississippi"])
length = pd.Series([10434,453445,2132,324325,1213,343,5435], index=["nile","ganga","indus","brahmaputra","yangtze","mekong","mississippi"])
ncountries = pd.Series([3,6,2,8,9,2,1], index=["nile","ganga","indus","brahmaputra","yangtze","mekong","mississippi"])
significance = pd.Series([10,9,8,7,6,5,4], index=["nile","ganga","indus","brahmaputra","yangtze","mekong","mississippi"])
test = pd.Series([10,9,6,5,4], index=["nile","ganga","yangtze","mekong","mississippi"]) # Notice in sufficient data in this column

rivers=pd.DataFrame({"Origin":corigin, "Length":length, "Num-Countries":ncountries, "Local-Significance":significance, "Test":test})
print(rivers)

# Accessing all the indices and values
print("Indices={}\nValues=\n{}\n".format(rivers.index, rivers.values))
print("rivers['Origin']=\n{}\n".format(rivers['Origin']))

# Access part of the dataframe
print("rivers['ganga':'nile']=\n{}\n".format(rivers['ganga':'nile']))

# Accessing via a mask
print("rivers[rivers.Length > 343]=\n{}\n\n".format(rivers[rivers.Length > 343]))

# Accessing an entire row
print("row 'ganga' of rivers=\n{}".format(rivers.T['ganga']))

               Origin  Length  Num-Countries  Local-Significance  Test
brahmaputra     china  324325              8                   7   NaN
ganga           india  453445              6                   9   9.0
indus        pakistan    2132              2                   8   NaN
mekong          tibet     343              2                   5   5.0
mississippi        us    5435              1                   4   4.0
nile            egypt   10434              3                  10  10.0
yangtze         india    1213              9                   6   6.0
Indices=Index(['brahmaputra', 'ganga', 'indus', 'mekong', 'mississippi', 'nile',
       'yangtze'],
      dtype='object')
Values=
[['china' 324325 8 7 nan]
 ['india' 453445 6 9 9.0]
 ['pakistan' 2132 2 8 nan]
 ['tibet' 343 2 5 5.0]
 ['us' 5435 1 4 4.0]
 ['egypt' 10434 3 10 10.0]
 ['india' 1213 9 6 6.0]]

rivers['Origin']=
brahmaputra       china
ganga             india
indus          pakistan
mekong            tibet
mississippi          us
nile              egypt
yangtze           india
Name: Origin, dtype: object

rivers['ganga':'nile']=
               Origin  Length  Num-Countries  Local-Significance  Test
ganga           india  453445              6                   9   9.0
indus        pakistan    2132              2                   8   NaN
mekong          tibet     343              2                   5   5.0
mississippi        us    5435              1                   4   4.0
nile            egypt   10434              3                  10  10.0

rivers[rivers.Length > 343]=
               Origin  Length  Num-Countries  Local-Significance  Test
brahmaputra     china  324325              8                   7   NaN
ganga           india  453445              6                   9   9.0
indus        pakistan    2132              2                   8   NaN
mississippi        us    5435              1                   4   4.0
nile            egypt   10434              3                  10  10.0
yangtze         india    1213              9                   6   6.0


row 'ganga' of rivers=
Origin                 india
Length                453445
Num-Countries              6
Local-Significance         9
Test                       9
Name: ganga, dtype: object

In [6]:
a = pd.DataFrame(np.random.randint(1,100,size=(2,4)), columns=list('ABCD'))
a

    A   B   C   D
0  99  33   2  70
1  25  28  20  99

## Addition

In [7]:
a = pd.DataFrame(np.random.randint(1,20,size=(2,3)), columns=['A1', 'A2', 'A3'])
b = pd.DataFrame(np.random.randint(1,20,size=(5,3)))
print("a=\n{}\n\nb=\n{}\n\na+b=\n{}\n\n".format(a,b,a+b))

b = pd.DataFrame(np.random.randint(1,20,size=(5,3)), columns=['A1', 'A2', 'A3'])
print("b=\n{}\n\na+b=\n{}\n\na+b(with zero filling)=\n{}".format(b,a+b,a.add(b,fill_value=0)))

a=
   A1  A2  A3
0  17   7  10
1  16   8   7

b=
    0   1   2
0   5   5   2
1  17   4  13
2   5  16   4
3  16  12   4
4  15  13  16

a+b=
   A1  A2  A3   0   1   2
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN
4 NaN NaN NaN NaN NaN NaN


b=
   A1  A2  A3
0  12  18  17
1   3   5  12
2   4  12  10
3   6  15   7
4  15  19   9

a+b=
     A1    A2    A3
0  29.0  25.0  27.0
1  19.0  13.0  19.0
2   NaN   NaN   NaN
3   NaN   NaN   NaN
4   NaN   NaN   NaN

a+b(with zero filling)=
     A1    A2    A3
0  29.0  25.0  27.0
1  19.0  13.0  19.0
2   4.0  12.0  10.0
3   6.0  15.0   7.0
4  15.0  19.0   9.0

## From numpy arrays

In [8]:
a = pd.DataFrame(np.random.rand(3,2), columns=["A", "B"], index=["ID1","ID2","ID3"])
b = pd.DataFrame(np.random.randint(6,size=(3,2)), columns=["A", "B"], index=["ID1","ID2","ID3"])
print("a=\n{}\n\nb=\n{}\n".format(a,b))
print("a['A']=\n{}".format(a["A"])) # Note the difference to the structured arrays of numpy. In case of structured
                                    # arrays of numpy, the rows can be accessed by indexing where as in this case
                                    # it is not possible

# Note pandas index object is immutable. They can be accessed but cannot be modified
i = a.index
print("\nIndices of a=\n{}".format(i))
print("Accessing an index is fine, i[2]={}".format(i[2]))
# But changing an index value is not allowed ... The following will give an error
#i[2] = "New Label"

a=
            A         B
ID1  0.620335  0.951619
ID2  0.582514  0.583972
ID3  0.864342  0.513530

b=
     A  B
ID1  0  0
ID2  1  4
ID3  0  2

a['A']=
ID1    0.620335
ID2    0.582514
ID3    0.864342
Name: A, dtype: float64

Indices of a=
Index(['ID1', 'ID2', 'ID3'], dtype='object')
Accessing an index is fine, i[2]=ID3

# Accessing using indexes: loc, iloc

In [16]:
# Series data
a = pd.Series([34,23,56,76,212,56,776], index=[11,22,33,44,55,66,None])
print(a,'\n');
# Notice the 'i' in iloc which stands for implicit
# 'loc' --> Explicit indexing
# 'iloc' --> Implicit indexing
print("Explicit indexing as defined by the index field: a.loc[33]={}".format(a.loc[33]))
print("Implicit indexing of the DF: a.iloc[2]={}".format(a.iloc[2]))


#######################################################################################
# DataFrame
#######################################################################################
b = pd.DataFrame()

11      34
22      23
33      56
44      76
55     212
66      56
NaN    776
dtype: int64

Explicit indexing as defined by the index field: a.loc[33]=56
Implicit indexing of the DF: a.iloc[2]=56

# Dealing with NaN values

In [60]:
# Example-1: Series data
a = pd.Series(range(9))
for idx in [1,3,5,7]:
    a[idx] = np.nan

print("a={}\n\na.dropna()={}\n\na.fillna(437)={}".format(a, a.dropna(), a.fillna(437)))


# Example-2: DataFrames
a = pd.DataFrame(np.random.randint(1,50,size=(4,6)), columns=['A', 'B', 'C', 'D', 'E', 'F'])
print(a,'\n')
a[2] = pd.Series([1, 5, 99, np.nan, 33, np.nan])
print(a,'\n')

a=0    0.0
1    NaN
2    2.0
3    NaN
4    4.0
5    NaN
6    6.0
7    NaN
8    8.0
dtype: float64

a.dropna()=0    0.0
2    2.0
4    4.0
6    6.0
8    8.0
dtype: float64

a.fillna(437)=0      0.0
1    437.0
2      2.0
3    437.0
4      4.0
5    437.0
6      6.0
7    437.0
8      8.0
dtype: float64
    A   B   C   D   E   F
0  29   5  35  28  17  30
1  17  42  29  49  40  23
2  15  21  32  34  15  44
3  33  28  30   3  14   6

    A   B   C   D   E   F     2
0  29   5  35  28  17  30   1.0
1  17  42  29  49  40  23   5.0
2  15  21  32  34  15  44  99.0
3  33  28  30   3  14   6   NaN

# MultiIndex
## DataFrame

In [61]:
# Creating a DataFrame
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]
newIndex = pd.MultiIndex.from_tuples(index)
pop = pd.DataFrame(populations, index=newIndex, columns=["Population"])
print("pop=\n{}\n\npop[\"Population\"]=\n{}\n\npop.Population=\n{}".format(pop, pop["Population"], pop.Population))
# print(pop); print("\n"); print(pop["Population"]); print("\n"); print(pop.Population)

pop=
                 Population
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

pop["Population"]=
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
Name: Population, dtype: int64

pop.Population=
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
Name: Population, dtype: int64

In [62]:
df = pd.DataFrame(np.random.rand(4, 2), index=[['a', 'a', 'b', 'c'], [1, 2, 3, 4]], columns=['data1', 'data2'])
df

        data1     data2
a 1  0.204584  0.148935
  2  0.919716  0.251233
b 3  0.066092  0.432395
c 4  0.523733  0.977244

In [63]:
a = pd.DataFrame(np.random.randint(50, size=(3,6))
                 , index=pd.MultiIndex.from_arrays([["R1", "R2", "R3"], ["R1.1", "R1.2", "R2.3"]], names=["TopRow", "LowerRow"])
                 , columns=pd.MultiIndex.from_arrays([["H1", "H2", "H3", "H4", "H5", "H6"], ["H1.1", "H1.2", "H1.3", "H1.4", "H1.5", "H1.6"]], names=["TopCol", "LowerCol"]))
a

TopCol            H1   H2   H3   H4   H5   H6
LowerCol        H1.1 H1.2 H1.3 H1.4 H1.5 H1.6
TopRow LowerRow
R1     R1.1       23   44   24   13   21   20
R2     R1.2       20   27    5    7   44   12
R3     R2.3       47   44   46   45   43   19

In [64]:
a = pd.DataFrame(np.random.randint(60, size=(6,10))
                 , index=pd.MultiIndex.from_product([["R1", "R2", "R3"], [0,1]], names=["TopRow", "LowerRow"])
                 , columns=pd.MultiIndex.from_product([["H1", "H2", "H3", "H4", "H5"], ['Foo','Doo']], names=["TopCol", "LowerCol"]))
a

TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R1     0         44  22  26  55   8   5   8   9  28  14
       1         45  36  22  54  26  31  28  20  54  20
R2     0         52  45  19   0  33   2  20  31  17   2
       1         26  21  12  28  19  22  19   7  46   8
R3     0         41  35  21   2  26   1  40  59  43  40
       1         50   4  26  41  42   2  33  25  42  41

In [65]:
a["H2"]['Doo']

TopRow  LowerRow
R1      0           55
        1           54
R2      0            0
        1           28
R3      0            2
        1           41
Name: Doo, dtype: int32

## Stacking, reset_index

* axis has the same meaning as in the case of numpy arrays
* levels are a new concept using in multiindexed panda arrays:
        * level=0: The upper most level of hierarchy
        * level=1: The hierarchy level one below the upper most one 
        * level=n: The nth level of hierarchy relative to the topmost item
* To represent something uniquely we need the axis and the level at the same time. 
        * Example: axis=0 and level=0, will represent the top most rows
        * Example: axis=1 and level=0, will represent the top most columns
* One can also represent the level in terms of its name. Example: 'TopCol' represents level=0, 'LowerCol' represents level=1.

In [66]:
a.unstack(level=0) # Unstack based on the outermost index or index level 0 (in this case 'TopRow' (R1, R2, and R3))

TopCol    H1                      H2              ...  H4              H5      \
LowerCol Foo         Doo         Foo         Doo  ... Foo Doo         Foo
TopRow    R1  R2  R3  R1  R2  R3  R1  R2  R3  R1  ...  R3  R1  R2  R3  R1  R2
LowerRow                                          ...
0         44  52  41  22  45  35  26  19  21  55  ...  40   9  31  59  28  17
1         45  26  50  36  21   4  22  12  26  54  ...  33  20   7  25  54  46

TopCol
LowerCol     Doo
TopRow    R3  R1 R2  R3
LowerRow
0         43  14  2  40
1         42  20  8  41

[2 rows x 30 columns]

In [67]:
a.unstack(level=1)  # Unstack based on the index level 1 (in this case 'LowerRow' (0 and 1))

TopCol    H1              H2              H3              H4              H5  \
LowerCol Foo     Doo     Foo     Doo     Foo     Doo     Foo     Doo     Foo
LowerRow   0   1   0   1   0   1   0   1   0   1   0   1   0   1   0   1   0
TopRow
R1        44  45  22  36  26  22  55  54   8  26   5  31   8  28   9  20  28
R2        52  26  45  21  19  12   0  28  33  19   2  22  20  19  31   7  17
R3        41  50  35   4  21  26   2  41  26  42   1   2  40  33  59  25  43

TopCol
LowerCol     Doo
LowerRow   1   0   1
TopRow
R1        54  14  20
R2        46   2   8
R3        42  40  41

In [68]:
b = a.reset_index() # Remove the multi-indices and convert them to columns
print(a); print(b) # Notice that after the reset, the 'TopRow' and 'LowerRow' which were reset 
                   # due to the command have no 'LowerCol' (obviously), as they were not defined.

TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R1     0         44  22  26  55   8   5   8   9  28  14
       1         45  36  22  54  26  31  28  20  54  20
R2     0         52  45  19   0  33   2  20  31  17   2
       1         26  21  12  28  19  22  19   7  46   8
R3     0         41  35  21   2  26   1  40  59  43  40
       1         50   4  26  41  42   2  33  25  42  41
TopCol   TopRow LowerRow  H1      H2      H3      H4      H5
LowerCol                 Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
0            R1        0  44  22  26  55   8   5   8   9  28  14
1            R1        1  45  36  22  54  26  31  28  20  54  20
2            R2        0  52  45  19   0  33   2  20  31  17   2
3            R2        1  26  21  12  28  19  22  19   7  46   8
4            R3        0  41  35  21   2  26   1  40  59  43  40
5            R3        1  50   4  26  41  42   2  33  25  42  41

In [69]:
# b['TopRow']['Foo'] --> This will result in an error. No 'Foo' defined for 'TopRow' after the reset
b['TopRow'][0]

'R1'

In [70]:
b.set_index(['TopRow', 'LowerRow']) # Setting 'TopRow' and 'LowerRow' as indices again.
                                    # This should result in the same original array
# b.set_index(['H1', 'H2']) --> Will result in an error (Most likely because they have lower indices 'Foo' and 'Doo')

TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R1     0         44  22  26  55   8   5   8   9  28  14
       1         45  36  22  54  26  31  28  20  54  20
R2     0         52  45  19   0  33   2  20  31  17   2
       1         26  21  12  28  19  22  19   7  46   8
R3     0         41  35  21   2  26   1  40  59  43  40
       1         50   4  26  41  42   2  33  25  42  41

In [71]:
a

TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R1     0         44  22  26  55   8   5   8   9  28  14
       1         45  36  22  54  26  31  28  20  54  20
R2     0         52  45  19   0  33   2  20  31  17   2
       1         26  21  12  28  19  22  19   7  46   8
R3     0         41  35  21   2  26   1  40  59  43  40
       1         50   4  26  41  42   2  33  25  42  41

In [72]:
a.mean(level='TopRow') # Get mean of each level of type 'TopRow'

TopCol      H1          H2          H3          H4          H5
LowerCol   Foo   Doo   Foo   Doo   Foo   Doo   Foo   Doo   Foo   Doo
TopRow
R1        44.5  29.0  24.0  54.5  17.0  18.0  18.0  14.5  41.0  17.0
R2        39.0  33.0  15.5  14.0  26.0  12.0  19.5  19.0  31.5   5.0
R3        45.5  19.5  23.5  21.5  34.0   1.5  36.5  42.0  42.5  40.5

In [73]:
a.mean(axis=1, level='LowerCol') # Take the average of all the 'Foo' sub-columns (level=1)

LowerCol          Foo   Doo
TopRow LowerRow
R1     0         22.8  21.0
       1         35.0  32.2
R2     0         28.2  16.0
       1         24.4  17.2
R3     0         34.2  27.4
       1         38.6  22.6

In [74]:
a.mean(axis=1, level=1) # Same as level='LowerCol'

LowerCol          Foo   Doo
TopRow LowerRow
R1     0         22.8  21.0
       1         35.0  32.2
R2     0         28.2  16.0
       1         24.4  17.2
R3     0         34.2  27.4
       1         38.6  22.6

In [75]:
a.mean(axis=1, level=0) # Taking the average at level=0 and axis=1

TopCol             H1    H2    H3    H4    H5
TopRow LowerRow
R1     0         33.0  40.5   6.5   8.5  21.0
       1         40.5  38.0  28.5  24.0  37.0
R2     0         48.5   9.5  17.5  25.5   9.5
       1         23.5  20.0  20.5  13.0  27.0
R3     0         38.0  11.5  13.5  49.5  41.5
       1         27.0  33.5  22.0  29.0  41.5

## Concatenation

In [76]:
a

TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R1     0         44  22  26  55   8   5   8   9  28  14
       1         45  36  22  54  26  31  28  20  54  20
R2     0         52  45  19   0  33   2  20  31  17   2
       1         26  21  12  28  19  22  19   7  46   8
R3     0         41  35  21   2  26   1  40  59  43  40
       1         50   4  26  41  42   2  33  25  42  41

In [77]:
Foo = a['R1':'R2']
Doo = a['R3':'R3']
print(Foo); print(Doo);

TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R1     0         44  22  26  55   8   5   8   9  28  14
       1         45  36  22  54  26  31  28  20  54  20
R2     0         52  45  19   0  33   2  20  31  17   2
       1         26  21  12  28  19  22  19   7  46   8
TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R3     0         41  35  21   2  26   1  40  59  43  40
       1         50   4  26  41  42   2  33  25  42  41

In [78]:
pd.concat([Foo, Doo]) # Default, axis=0 (meaning concatenation along rows)

TopCol           H1      H2      H3      H4      H5
LowerCol        Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
TopRow LowerRow
R1     0         44  22  26  55   8   5   8   9  28  14
       1         45  36  22  54  26  31  28  20  54  20
R2     0         52  45  19   0  33   2  20  31  17   2
       1         26  21  12  28  19  22  19   7  46   8
R3     0         41  35  21   2  26   1  40  59  43  40
       1         50   4  26  41  42   2  33  25  42  41

In [79]:
pd.concat([Foo,Doo], axis=1) # Concatenation along columns. Observe how the unknown values are replaced with 'NaN'
                             # By default the two DFs

TopCol             H1          H2          H3          H4          H5        \
LowerCol          Foo   Doo   Foo   Doo   Foo   Doo   Foo   Doo   Foo   Doo
TopRow LowerRow
R1     0         44.0  22.0  26.0  55.0   8.0   5.0   8.0   9.0  28.0  14.0
       1         45.0  36.0  22.0  54.0  26.0  31.0  28.0  20.0  54.0  20.0
R2     0         52.0  45.0  19.0   0.0  33.0   2.0  20.0  31.0  17.0   2.0
       1         26.0  21.0  12.0  28.0  19.0  22.0  19.0   7.0  46.0   8.0
R3     0          NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
       1          NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN

TopCol             H1          H2          H3         H4          H5
LowerCol          Foo   Doo   Foo   Doo   Foo  Doo   Foo   Doo   Foo   Doo
TopRow LowerRow
R1     0          NaN   NaN   NaN   NaN   NaN  NaN   NaN   NaN   NaN   NaN
       1          NaN   NaN   NaN   NaN   NaN  NaN   NaN   NaN   NaN   NaN
R2     0          NaN   NaN   NaN   NaN   NaN  NaN   NaN   NaN   NaN   NaN
       1          NaN   NaN   NaN   NaN   NaN  NaN   NaN   NaN   NaN   NaN
R3     0         41.0  35.0  21.0   2.0  26.0  1.0  40.0  59.0  43.0  40.0
       1         50.0   4.0  26.0  41.0  42.0  2.0  33.0  25.0  42.0  41.0

In [80]:
pd.concat([Foo,Doo], ignore_index=True)

TopCol    H1      H2      H3      H4      H5
LowerCol Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
0         44  22  26  55   8   5   8   9  28  14
1         45  36  22  54  26  31  28  20  54  20
2         52  45  19   0  33   2  20  31  17   2
3         26  21  12  28  19  22  19   7  46   8
4         41  35  21   2  26   1  40  59  43  40
5         50   4  26  41  42   2  33  25  42  41

In [81]:
pd.concat([Foo, Doo], keys=["Zoo", "Moo"])

TopCol               H1      H2      H3      H4      H5
LowerCol            Foo Doo Foo Doo Foo Doo Foo Doo Foo Doo
    TopRow LowerRow
Zoo R1     0         44  22  26  55   8   5   8   9  28  14
           1         45  36  22  54  26  31  28  20  54  20
    R2     0         52  45  19   0  33   2  20  31  17   2
           1         26  21  12  28  19  22  19   7  46   8
Moo R3     0         41  35  21   2  26   1  40  59  43  40
           1         50   4  26  41  42   2  33  25  42  41

In [82]:
countries = pd.DataFrame({"Countries": ["India", "US", "China", "Russia", "Brazil"]})
states = pd.DataFrame({"India": ["AP", "Telangana", "MP", "Rajasthan", "UP", "Bihar", "TN"]
                    , "US":["Washington", "California", "Colorado", "NY", "Texas", "NewMexico", "Utah"]
                    , "China": ["One", "Two", "Three", "Four", "Five", "Six", "Seven"]
                    , "Russia": ["One", "Two", "Three", "Four", "Five", "Six", "Seven"]})

pop = pd.DataFrame({"India": [400, 500, 600, 700, 800, 900, 1000]
                    , "US":[1100, 1200, 1300, 1400, 1500, 1600, 1700]
                    , "China": [2100, 2200, 2300, 2400, 2500, 2600, 2700]
                    , "Brazil": [2100, 2200, 2300, 2400, 2500, 2600, 2700]})

'''
res = pd.DataFrame({"Germany": [400, 500, 600, 700, 800, 900, 1000]
                    , "US":[1100, 1200, 1300, 1400, 1500, 1600, 1700]
                    , "China": [2100, 2200, 2300, 2400, 2500, 2600, 2700]})
'''

print(countries); print(states); print(pop)

##################################################################
##################################################################
###############   INCOMPLETE EXAMPLE (FIX THIS)
##################################################################
##################################################################

  Countries
0     India
1        US
2     China
3    Russia
4    Brazil
       India          US  China Russia
0         AP  Washington    One    One
1  Telangana  California    Two    Two
2         MP    Colorado  Three  Three
3  Rajasthan          NY   Four   Four
4         UP       Texas   Five   Five
5      Bihar   NewMexico    Six    Six
6         TN        Utah  Seven  Seven
   India    US  China  Brazil
0    400  1100   2100    2100
1    500  1200   2200    2200
2    600  1300   2300    2300
3    700  1400   2400    2400
4    800  1500   2500    2500
5    900  1600   2600    2600
6   1000  1700   2700    2700

In [83]:
pop = pd.DataFrame({"Countries": ["India", "US", "China", "Russia", "Brazil"]
                         , "States": [10,20,30,40,50]
                         , "Population": [83424234, 234234223, 32664835, 242132425, 4343234244]})
lang = pd.DataFrame({"Countries": ["India", "US", "China", "Russia", "Brazil"]
                   , "Language": ["Hindi", "English", "Chinese", "Russian", "Portugese"]
                   , "Other-imp-Language": ["Telugu", "Spanish", "Chinese", "Urdu", "Spanish"]})

print(pop); print(lang);

  Countries  States  Population
0     India      10    83424234
1        US      20   234234223
2     China      30    32664835
3    Russia      40   242132425
4    Brazil      50  4343234244
  Countries   Language Other-imp-Language
0     India      Hindi             Telugu
1        US    English            Spanish
2     China    Chinese            Chinese
3    Russia    Russian               Urdu
4    Brazil  Portugese            Spanish

In [84]:
pd.merge(pop, lang, on="Countries") # Note the passed arguments, 'pop' and 'lang' are not
                                    # passed as a list but as individual arguments

  Countries  States  Population   Language Other-imp-Language
0     India      10    83424234      Hindi             Telugu
1        US      20   234234223    English            Spanish
2     China      30    32664835    Chinese            Chinese
3    Russia      40   242132425    Russian               Urdu
4    Brazil      50  4343234244  Portugese            Spanish

In [85]:
lang = pd.DataFrame({"Nations": ["India", "US", "China", "Russia", "Brazil"]
                   , "Language": ["Hindi", "English", "Chinese", "Russian", "Portugese"]
                   , "Other-imp-Language": ["Telugu", "Spanish", "Chinese", "Urdu", "Spanish"]})

pd.merge(pop, lang, left_on="Countries", right_on="Nations") # Note here the keywords left_on and right_on. They are used
                                                             # to tell Pandas that the coloumn over which the merge operation
                                                             # will be done is called 'Countries' in the DataFrame 'pop', whereas
                                                             # the DataFrame where 'right_on' is specified the column is 
                                                             # called 'Nations'

  Countries  States  Population Nations   Language Other-imp-Language
0     India      10    83424234   India      Hindi             Telugu
1        US      20   234234223      US    English            Spanish
2     China      30    32664835   China    Chinese            Chinese
3    Russia      40   242132425  Russia    Russian               Urdu
4    Brazil      50  4343234244  Brazil  Portugese            Spanish

In [86]:
pd.merge(pop, lang, left_on="Countries", right_on="Nations").drop("Nations", axis=1)

  Countries  States  Population   Language Other-imp-Language
0     India      10    83424234      Hindi             Telugu
1        US      20   234234223    English            Spanish
2     China      30    32664835    Chinese            Chinese
3    Russia      40   242132425    Russian               Urdu
4    Brazil      50  4343234244  Portugese            Spanish

## Series

In [87]:
# Creating a Series
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2015)]
populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]
newIndex = pd.MultiIndex.from_tuples(index)
pop = pd.Series(populations, index=newIndex)
print("pop=\n{}\n\npop[:,2015]=\n{}\n\npop.unstack()=\n{}\n".format(pop, pop[:,2015], pop.unstack()))

# Creating a DataFrame using a series
pop_df = pd.DataFrame({'total': pop, 'under18': [9267089, 9284094, 4687374, 4318033, 5906301, 6879014]})
print("pop_df=\n{}\n".format(pop_df))
# Note if the DataFrame has more than 1 columns, then indexing as shown below is not possible
#print("pop_df['Texas',2015]=\n{}".format(pop_df['Texas',2015]))
print("pop['Texas',2015]=\n{}\n".format(pop['Texas',2015]))
print("pop[:,2010]=\n{}\n".format(pop[:,2010]))
print("pop['Texas':'California']=\n{}\n".format(pop['Texas':'California']))
print("pop['California':'Texas']=\n{}\n".format(pop['California':'Texas']))

pop=
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2015    25145561
dtype: int64

pop[:,2015]=
Texas    25145561
dtype: int64

pop.unstack()=
                  2000        2010        2015
California  33871648.0  37253956.0         NaN
New York    18976457.0  19378102.0         NaN
Texas       20851820.0         NaN  25145561.0

pop_df=
                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2015  25145561  6879014

pop['Texas',2015]=
25145561

pop[:,2010]=
California    37253956
New York      19378102
dtype: int64

pop['Texas':'California']=
Series([], dtype: int64)

pop['California':'Texas']=
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2015    25145561
dtype: int64

# Recipes

In [93]:
a = pd.DataFrame([34,None,56,76,None,212,56,None], index=["A","B","C","D","E",None,"F","NA"], columns=['Indices'])
print(a)

     Indices
A       34.0
B        NaN
C       56.0
D       76.0
E        NaN
NaN    212.0
F       56.0
NA       NaN